{"review": "Bears about as much resemblance to Dean Koontz's novel as Jessica Simpson does to a rocket scientist. If you've read the book, I suggest you put it as far out of your mind as possible before watching the movie.<br /><br />Watchers is your typical \"Boy meets dog, dog turns out to be super-intelligent government lab experiment, dog and boy are pursued by super-intelligent and emotionally disturbed monster created by same lab, and, oh yeah, did I mention the shady government agents pursuing the monster pursuing the dog?\" movie.<br /><br />Corey Haim is the boy, Barbara Williams is his mother, Michael Ironside is one of the evil government guys, and Sandy the dog is, well, the dog (named Furface here; Einstein in the book).<br /><br />The monster effects are ridiculously cheesy, much of the dialogue is laughable, the script rarely makes sense or is believable - a good example is Haim's character's unquestioning acceptance of the dog's intelligence, as if every Fido off the street can type messages on a computer keyboard or bark once for yes and twice for no! Hmm, it's gotta be the puppy chow, right? Haim's performance is enthusiastic but shaky, as he carries off the stupid dialogue with the least amount of skill. Ironside has been the highlight of many a bad movie, and this is no exception. He easily gives the best performance of the movie, although I'm compelled to add that the dog (who's a pretty darn good actor himself!) comes in a close second.<br /><br />All in all, an atrociously dumb movie, and yet . . . And yet I watched it three times within a week. And yet I can't help liking it. Hey, what can I say, I have a taste for junk - and Michael Ironside (not that I've ever actually tasted Michael Ironside- I'm sure there are laws against that). But any movie that can make me laugh that hard (yes, even unintentionally) can't be all bad. Chalk it up to a guilty pleasure, a \"yes I know it's insultingly stupid but I like it anyway\" movie.<br /><br />It's tough for me to rate this. On a normal scale I'm forced to give it a D-, but on my own personal cheese scale, it gets bumped up to an A-.<br /><br />Yeah, I know. I'm weird like that.", "my_review": "The long review appears to have mostly negative verbage about the movie being \"dumb\".\nThough the author talks about the movie being bad, they give it a positive review because it plays to their taste, \"Chalk it up to a guilty pleasure, a 'yes I know it's insultingly stupid but I like it anyway' movie.\"", "label": 1, "predicted": "tensor(0)", "csv_index": 958}
{"review": "I saw this film right in the middle while going through a breakup. It was about 3 in the morning and I was battling insomnia with a quick snack. It wasn't too bad at the time, but every time I have tried to watch it since, I can't get into it like I did that night.<br /><br />At the time I thought it was cute and I loved the variety of characters, though they totally could have done better than Goran V, in my opinion. But the one thing that kept me watching was Heather's character and her sad \"commitment\" to her husband who didn't want her anymore, which made me feel sorry for her and root for her at the same time. (Considering I was in a similar situation at the time, perhaps that's why I liked her so much.) Not a bad film, but you pretty much have to be somewhere near the character romantically in order to appreciate it, and let's hope you never are.", "my_review": "This critic rides the line of okay film with language like: \"wasn't too bad\", \"I thought it was cute..., though they totally could have done better...\", \"not a bad film...\".\nHard to label this in general as positive or negative.", "label": 0, "predicted": "tensor(1)", "csv_index": 136}
{"review": "I very well remember the bad press this film got because of the producers' court order against Clayton Moore using the name \"Lone Ranger\" or donning his black mask at personal appearances. Quite apart from any consideration of the film's quality, this was the absolute height of nearsighted arrogance and stupidity on the part of the producers and their attorneys. And I suspect that the lesson was well-learned after this film tanked, which was widely perceived as some sort of karma for the jerks responsible for the court order against Moore.<br /><br />In more recent times it has become the custom, when reviving a legendary film or TV project, to invite the original star or stars for cameo appearances, and rightly so. Show some respect, you idiots! And even if they turn up their noses at the prospect, which has happened, at least the offer was made. This is proof positive that film producers, studio executives, and entertainment attorneys are not quite too stupid and arrogant to be taught by example.", "my_review": "Lots of negative verbage in this review, but it doens't seem to form a real negative review of the film itself.  At the end, it reads: \"This is proof positive that film producers, studio executives, and entertainment attorneys are not quite too stupid and arrogant to be taught by example.\" Which could be proceived as positive I suppose.", "label": 0, "predicted": "tensor(1)", "csv_index": 409}
{"review": "There are so very few films where just the title tells you all you need to know about the film. Such a film is I Was A Communist For The FBI. Another example would be I Married A Monster From Outer Space.<br /><br />The really interesting thing about this film is how in heaven's name did this get nominated for an Oscar in the documentary category? It is not a documentary in any sense of the word, it's not even in that hybrid category of docudrama. It's just a rather exploitive film about the work of an FBI undercover agent named Matt Cvetic who infiltrated the Communist Party in Pittsburgh and got active in trying to take over the Steelworker's Union for the Communists and reporting on said activities to his handlers in the FBI.<br /><br />A documentary of that work might have been interesting, but what we got was a film to fit those paranoid times. I found it fascinating that when Cvetic finally broke his cover it was to the House Un-American Activities Committee rather than the trial in New York of the Communist Party leaders. There was a moment in the film where head Communist James Millican tells his followers to start spreading the word that the House Un American Activities Committee was composed of a bunch of right wing yahoos looking to get their names in front of the camera. Now what could have given him that idea? Anyway just connect the dots and no doubt the word their came from J. Edgar Hoover trying to give some credence to HUAC by having an effective undercover come out there rather than at an actual trial. Little thing there called cross examination.<br /><br />Warner Brothers who produced I Was A Communist For The FBI later produced Big Jim McLain which starred John Wayne about a HUAC investigator in Hawaii. HUAC did grab on to credit for the work done by the Honolulu PD in breaking up a Communist spy ring there among the dockworkers. But at least in John Wayne's film nobody claimed it was a documentary.<br /><br />Frank Lovejoy is in the title role as Cvetic and his FBI handlers are Richard Webb and Philip Carey. Dorothy Hart plays a Pittsburgh school teacher who says that there are 30 or so like here in that school system indoctrinating the young among whom is Ron Hagerthy, Lovejoy's son. She has a change of heart about the Communists and Lovejoy has to save her from a homicidal fate planned by his superiors. Ironically Hart left the movies and went to work for all places, the United Nations which as we know has been accused often of being a Communist nest in the USA.<br /><br />Over half a century later and we really have very few objective works on film or in print about the Communist Party of the USA. They were in fact a very active bunch in the labor movement. The real heroes in stopping them were labor organizers like Walter Reuther in the UAW or David Dubinsky in the ILGWU. But since they were people of the left they just don't have the following on the right to be suitable propaganda material.<br /><br />Anyway I Was A Communist For The FBI is an exploitive work based on a real life character and a testament to those paranoid times.", "my_review": "LONG TEXT with movie recap.  There is one sentence that shows that it is a negative review, but the general sense of the movie is positive, so I could see why the model predicted positive.", "label": 0, "predicted": "tensor(1)", "csv_index": 529}
{"review": "Believe me I wanted this series to work, but the early departure of Kevin Kilner dealt a near death blow after season one. Robert Leeshock just wasn't right for the part and Jane Heitmeyer did an admirable job as lead but the series just got too messy and confused at that point. I don't know what happened in Season Five, what a mess. Sometimes its time to drop the red cape and just stick the sword in the bull, if you know what I mean. The only consistent thread holding the series together were the amazing performances of Leni Parker and Anita LaSelva as the two Taelons in quiet idealogical conflict. If not for their talents and well-written dialogue they would have been two weird bald man-chicks in a B-movie series.<br /><br />If only this series could have ended at season 4 and picked up later by SyFy...", "my_review": "I'm surpised the gold label is positive, this reads to me like a clear negative review of the movie.", "label": 1, "predicted": "tensor(0)", "csv_index": 615}
{"review": "No matter how much it hurts me to say this,the movie is not as good as it could have been.Maybe I was misled by the countless exaggerated reviews here on IMDb,but I expected so much more...<br /><br />Sure,the idea is a good one,the violent scenes and the camera-work are outstanding,the imagination of genius Dario is breathtaking, but the movie is \"soiled\" by a couple of mistakes that I find unforgivable. First of all, am I one of the few people who feel that the Heavy Metal music played in the most intense scenes simply rips the atmosphere apart??? With a different kind of music (Goblin????) during the \"needle\" scenes,it would have been SOOOO intense!... Instead,the soundtrack destroys any chance for tension... Secondly, the final killing scene and the last few moments of the movie are simply silly and uninspired. I don't want to say \"amateurish\", cause I love Argento's movies.The ending left me feeling empty.Talk about a final impression! This is hardly what happens in most of Dario's films! Though,admittedly,Suspiria also suffers from a rushed finale (even if most of it is brilliant)....<br /><br />In short,watch this movie,try to make the most of its good points,but be prepared for some bad ones as well. This is NOT a perfect movie by ANY means.", "my_review": "Again, the gold label is positive, but the review appears to be more negative than positive.  Ultimately, it mixes \"good points\" with \"some bad ones\".", "label": 1, "predicted": "tensor(0)", "csv_index": 886}
{"review": "So forgive the *really* lame game-play scene, cardboard background and studio like stadium. For this part I should have give the movie 5 instead of 7, but read on...<br /><br />From the premise to plot there is a lot similarities with \"The Replacements\". Some say this movie rip off \"The Replacements\", while some say this script wrote before it. <br /><br />Both movies require some sort of \"suspension of disbelief on the basic premise, and this is especially difficult for \"Second String\" since it has NFL license team and all the history behind it. Food poison excuse may sound too lame for some people, and not to mention in \"Second String\" Bills has to overcome big scores again and again, with the limit budget in shooting the game play scene, this make it look even bad. <br /><br />In \"Replacements\", the premise and the league is fictional yet you know it happen in real life. I believe it is easier to accept fictional story and setting with real event (\"OH yeah, this happen before!\", rather than real setting/background with fictional scenario (\"There is no way Bill can win a Superbowl!\"; Some of the scene were actually shoot in pre season game of Raven games, real stadium, real audience and some NFL match alike shooting angle.<br /><br />But let say both movies came out on the same day, and we erase the budget factor (thus forgive the game play action scene): Overall, I like \"Second String\" over \"Replacements\", not by much, but I like this more. <br /><br />It has \"relatively better\" character development. In \"Replacements\", Keanu character is too \"out sync with the world\", and all he care is maybe, get a girl? In Second String you see the struggle of the QB from getting the job back, and deal with his past with coach. Or the fumble guy problem. This \"hold the ball all day long\" solution of course is not new, but we see progression in fixing it.<br /><br />How about those trick play? I think it is \"relatively realistic\" than \"Replacements\". The \"Dan Marino\" like fake knee pass, flea-flicker, wild cat full back rush, all real, except sometimes this look a bit too easy. But for me it is better than \"Replacement\"'s center catch and rushing for 50 yards call, or how a 60 yards field goal look too easy. OH BTW, I am glad they didn't force the TE kicker made his shot....<br /><br />Of course ---if you objectively review this movie over other football movies all there, this could easily be a 5 out of 10 movie. But some say this is the worse football movie? Try \"The Comebacks\".", "my_review": "Long review with both positive and negative remarks, officially rating 5 out of 10, so right in the middle.  I definately could see the model picking up negative.", "label": 1, "predicted": "tensor(0)", "csv_index": 833}
{"review": "I first watched Kindred in 1987 along with another movie called devouring waves. I remember back then i hated them both and i have never really bothered to watch them again.<br /><br />However i have recently started a crusade to collect as many 80's horror titles in their original boxed form, That have been deleted for some time. I have got myself quite a proud collection with many more titles on my list!<br /><br />The Kindred although i have not as yet got a copy is high priority as all the old movies i didn't like back then, I now own and have now re-watched and think they are brilliant and the bits i do remember of the Kindred are now driving me to want to get hold of a copy A.S.A.P.<br /><br />Hurray for the 80's and long live horror!", "my_review": "Seemed to \"hate it\" before, now after rewatching, \"...think they are brilliant...\".  Definately both positive and negative verbage.", "label": 0, "predicted": "tensor(1)", "csv_index": 369}
{"review": "I have recently found this film on one of my husband's VHS tapes (the blank variety which he uses to record stuff from the telly). The film looks as if it was last shown in the eighties and I don't remember having seen it since. It has not (to my knowledge) been released on DVD or VHS although I shall browse around for a copy.<br /><br />The film tells the story of three young people: two girls, one on the edge of puberty and the other much younger, and a young boy who go to live with their mother's brother and his young, mute Irish wife. His wife also has two brothers who live with them. The children's uncle is an unpleasant control freak who forces his young wife to wear a silver collar whilst she watches a marionette show put on by him and her brothers in his toyshop.<br /><br />The eldest girl and one of the Irishmen (the younger) develop a love for each other whilst they live in the same house. The girl helps her aunt out in the shop whilst her brother helps his uncle to make things in the workshop.<br /><br />There are a lot of very disturbing elements to the film. There is the uncle's treatment of his wife as some kind of dumb (literally) possession (illustrated by the collar) whilst the Irish indulge dancing, drinking and somewhat forbidden love. Interestingly, though, I have seen far more explicit themes played out in other movies made in Hollywood today.<br /><br />Makes you wonder whether the British film industry and the BBC have some kind of hidden agenda going on.<br /><br />Still, despite it not being a children's movie, there are a lot of playful, magic moments in it and the one Irishman does some beautiful paintings.", "my_review": "Another neutral movie recap.  The last line reads: \"Still, despite it not being a children's movie, there are a lot of playful, magic moments in it and the one Irishman does some beautiful paintings.\"  Which definately can be seen as positive.", "label": 0, "predicted": "tensor(1)", "csv_index": 530}
{"review": "The title refers not to a questionable poker hand, but to six comic players. They come in twos: Charles Ruggles and Mary Boland as a couple driving to California for a second honeymoon, George Burns and Gracie Allen as another couple who go along to share expenses, and W.C. Fields and Alison Skipworth as a sheriff and a hotel-owner in a tiny Nevada town. No attempt is made to fashion a coherent narrativeit's a collection of comic bits strung together. All the first couple want to do is spend time together, but Burns and Allen's characters aren't married, so the men bunk together, as do the women. There is a bit of a plot: a bad guy plants $50k in the suitcase Pinky (Ruggles) is taking out of town, but because the expedition is being guided by Gracie, the loot cannot be found. The bad guy shows up in Nevada and Fields accidentally captures him. A bunch of pleasant bits, Ruggles' confused expression, Gracie's batty, breakneck talk, and Fields playing billiards with a corkscrew cue and doing a fluttery, craven, backwards-stepping double-take when he's threatened, and his wonderfully distinctive way of lingering over words. And trying to remember the name \"Gracie,\" he tells Skipworth, \"Hmm. Starts with a K... McGonigle.\" She answers, \"Oh no, no, no, no...\" \"Mmmm. Wangahanky!\" \"No, no, no, no no. Oh, Gracie.\" \"Yes, that's right.\"", "my_review": "Another movie recap, labeled as positive, but there really isn't much of an opinion in this review.  Could go either way.\"", "label": 1, "predicted": "tensor(0)", "csv_index": 751}
